/**
 * Задача на повернення ініціалів для кожного імені з масиву, посортованих в алфавітному порядку:
 * @param {string[]} userNames — несортований масив імен користувачів
 * @returns {string[]} сортований в алфавітному порядку масив ініціалів користувачів 
 * @example
 * task(["Петрик Ольга Іванівна", "Гнатюк Петро Антонович", "Рудко Андрій Опанасович"]);
 * // returns [ "Г.П.А.", "П.О.І.", "Р.А.О."]
 * @example
 * task(["Чупакабра"]);
 * // returns [ "Ч"]
 * @example
 * task(["Сальвадор Феліп Жасінт Далі і Доме́нек"]);
 * // returns [ "С.Ф.Ж.Д.i.Д."]
 */

const task = (userNames) => {
  let initials;
  
  // тут ваш код ...

  return initials;
};

module.exports = task;